--1 Отримати список міст України які закінчуються на ‘ськ’
select * from cities 
where name like'%ськ';
--2 Отримати список міст України у назві яких є  ‘донец’
 select * from cities 
 where name like'%донец%';
--3 Отримати список міст з населенням більше ніж 100 000 з назвою у вигляді НАЗВА_МІСТА (РЕГІОН). Результат відсортувати за алфавітом
 select Concat(name, '(',region,')') from cities 
 where population > 100000;
--4 Отримати перші 10 міст України (за населенням) та додати до запити обчислюване поле в якому буде вказано який процент від усього населення країни проживає у цьому місті. За загальну кількість населення України беремо число - 40 000 000.
select name, population, (population/40000000) *100 as total_population_percent from cities 
order by population desc 
limit 10;
--5 Отримати  список міст України у яких населення більше чи дорівнює 0.1% від загального населення України. Список має бути у форматі НАЗВА_МІСТА - ПРОЦЕНТ_НАСЕЛЕННЯ %. Результат відсортувати за процентом населення.
select name, (population/40000000) * 100 as population_percent from cities 
where (population/40000000) * 100 > 0.1 
order by population_percent ;